# Weekly Challenge 13

*Original URL* https://community.alteryx.com/t5/Weekly-Challenge/Challenge-13-HTML-Table-Parsing/td-p/36741 and [**My Alteryx Approach**](https://github.com/dsmdavid/Alteryx-Weekly-Challenge/tree/master/submitted/sub_Challenge%2313)

## Brief

### Basic Text Mining:

 For this challenge letâ€™s look at creating a multi-level hierarchy from employee-manager data. As always there are several ways to do this challenge, I have designated it as an advanced challenge because some of the more complex functions like RegEx can be used, but it is not absolutely necessary. 

#### The use case:

We have HTML data that is in a single field, the HTML contains an HTML Table.

The input contains a series of name/value pairs within the description field. The description field has a HTML table that contains 14 name/value contained within <td> tags. Each pairing can be found on a different row (designated by the <tr> tag).

The objective is to produce a table containing the 14 name/value pairs.

In [1]:
import pandas as pd

## Approach I want to follow:
1. Read the data from html.
1. Select df.
1. Print it.

In [2]:
#Load the data to get recordID and html as an object:
input_df = pd.read_csv("./13_files/input.csv", encoding="latin")     
input_df

   RecordID                                        Description
0         1  <html xmlns:fo="http://www.w3.org/1999/XSL/For...

In [3]:
#Load the data using the html function from pandas --returns a list of df
list_df = pd.read_html(input_df.iloc[0,1])     
df = list_df[1]

In [4]:
#Rename Columns, add recordId
df.columns = ['Name','Value']
df["RecordID"] = 1*input_df.iloc[0,0]

In [5]:
df

                Name                                   Value  RecordID
0               Type                                     NaN         1
1              State                                     NaN         1
2         In Country                                     NaN         1
3                MSA                                    4885         1
4           FID Name                                     NaN         1
5           GLOBALID  {32D94405-66A5-4E2D-9A12-C074E123CB14}         1
6          Area Name                                Downtown         1
7            Area ID                            FH8950753280         1
8      Creation User                                     NaN         1
9         Date Stamp                                     NaN         1
10  Last Modified By                                     NaN         1
11             SHAPE                                 Polygon         1
12        SHAPE.AREA                          6148399.356068         1
13         SHAPE.LEN                            12697.232239         1